JournalData.reportToADP
Allow information associated with this Journal Data to get reported to ADP.
Returns: true if data can be reported to ADP, false otherwise.
Remarks:
Default is to allow (as appropriate) ADP reporting for the data.
Override this if under certain situations, the data should not to be
reported.  For example, an empty selection etc.